app/Http/Helper.php

        public static function messageList(): Collection
        {
            return Message::whereNull('read_at')->orderBy('created_at', 'desc')->get();
---
select * from `messages` where `read_at` is null order by `created_at` desc

        public static function postTagList()
        {
            if ($option = 'all') {
                return Tag::orderBy('id', 'desc')->get();
---
select * from `post_tags` order by `id` desc

        public static function postCategoryList()
        {
            if ($option = 'all') {
                return Category::orderBy('id', 'DESC')->get();
---
select * from `post_categories` order by `id` desc

        public static function cartCount(string $user_id = '')
        {
            if (Auth::check()) {
                if ($user_id == "") {
                    $user_id = auth()->user()->id;
                }
                return Cart::where('user_id', $user_id)->where('order_id', null)->sum('quantity');
---
select sum(`quantity`) as aggregate from `carts` where `user_id` = 2 and `order_id` is null

        public static function getAllProductFromCart(string $user_id = '')
        {
            if (Auth::check()) {
                if ($user_id == "") {
                    $user_id = auth()->user()->id;
                }
                return Cart::with('product')->where('user_id', $user_id)->where('order_id', null)->get();
---
select * from `carts` where `user_id` = 2 and `order_id` is null
select * from `products` where `products`.`id` in (9, 10)

        public static function totalCartPrice(string $user_id = '')
        {
            if (Auth::check()) {
                if ($user_id == "") {
                    $user_id = auth()->user()->id;
                }
                return Cart::where('user_id', $user_id)->where('order_id', null)->sum('amount');
---
select sum(`amount`) as aggregate from `carts` where `user_id` = 2 and `order_id` is null

        public static function wishlistCount(string $user_id = '')
        {
            if (Auth::check()) {
                if ($user_id == "") {
                    $user_id = auth()->user()->id;
                }
                return Wishlist::where('user_id', $user_id)->where('cart_id', null)->sum('quantity');
---
select sum(`quantity`) as aggregate from `wishlists` where `user_id` = 2 and `cart_id` is null

        public static function getAllProductFromWishlist(string $user_id = '')
        {
            if (Auth::check()) {
                if ($user_id == "") {
                    $user_id = auth()->user()->id;
                }
                return Wishlist::with('product')->where('user_id', $user_id)->where('cart_id', null)->get();
---
select * from `wishlists` where `user_id` = 2 and `cart_id` is null

        public static function totalWishlistPrice(string $user_id = '')
        {
            if (Auth::check()) {
                if ($user_id == "") {
                    $user_id = auth()->user()->id;
                }
                return Wishlist::where('user_id', $user_id)->where('cart_id', null)->sum('amount');
---
select sum(`amount`) as aggregate from `wishlists` where `user_id` = 2 and `cart_id` is null