tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "composer"
brew "openldap"
brew "dnsmasq", restart_service: true
brew "git"
brew "tcl-tk"
brew "httpd"
brew "imagemagick"
brew "krb5"
brew "mysql", restart_service: true
brew "nginx", restart_service: true
brew "node"
brew "nvm"
brew "php-cs-fixer"
brew "php@7.4", restart_service: true, link: true
brew "pkg-config"
