app/Http/ViewComposers/SettingsComposer.php

        public function compose(View $view)
        {
            $view->with('settings', Setting::get());
---
select * from `settings`