<?php

    return [
        'info' => 'Без разлика дали имате долга листа на возбудливи места што сакате да ги посетите
               или пак само сакате да бидете флексибилни за спонтани авантури, 
               BHL рент-а-кар е идеално решение за вас,
               Нашиот голем асортиман на различни категории на автомобили може да ги задоволи вашите потреби 
               за мобилност а нашиот возен парк е составен од современи возила произведени од некои од најдобрите 
               производители на автомобили во светот!',
        'title' => 'BHL рент а кар',
        'title_fitness' => 'Фитнес центар',
        'fitness_info' => 'Дали сте физички активни?
    Доколку сте од оние кои внимаваат на своето физичко здравје и фигура, тогаш FITNESS CLUB FIT центарот е одлично место за вас.
    FITNESS CLUB FIT центарот е опремен со најмодерната фитнес опрема што ќе ви помогне да изгледате онака како што посакувате.
    Секогаш сме тука за да ви помогнеме да останете во добра форма. ',

    ];
