app/Http/Controllers/CartController.php

select * from `carts` where `carts`.`id` = '10' limit 1
delete from `carts` where `id` = 10
---
    public function cartDelete(Request $request): RedirectResponse
    {
        $cart = Cart::find($request->id);
        if ($cart) {
            $cart->delete();

select * from `carts` where `carts`.`id` = '11' limit 1
update `carts` set `quantity` = '1', `amount` = 190, `carts`.`updated_at` = '2022-03-05 05:28:54' where `id` = 11
---
    public function cartUpdate(Request $request)
    {
        if ($request->quant) {
            $error = array();
            $success = '';
            // return $request->quant;
            foreach ($request->quant as $k => $quant) {
                // return $k;
                $id = $request->qty_id[$k];
                // return $id;
                $cart = Cart::find($id);
                // return $cart;
                if ($quant > 0 && $cart) {
                    // return $quant;

                    if ($cart->product->stock < $quant) {
                        request()->session()->flash('error', 'Out of stock');
                        return back();
                    }
                    $cart->quantity = ($cart->product->stock > $quant) ? $quant : $cart->product->stock;
                    // return $cart;

                    if ($cart->product->stock <= 0) {
                        continue;
                    }
                    $after_price = ($cart->product->price - ($cart->product->price * $cart->product->discount) / 100);
                    $cart->amount = $after_price * $quant;
                    // return $cart->price;
                    $cart->save();