app/Http/Controllers/FrontendController.php

select * from `products` where `status` = 'active' and `is_featured` = 1 order by `price` desc limit 2
select * from `posts` where `status` = 'active' order by `id` desc limit 3
select * from `banners` where `status` = 'active' order by `id` desc limit 3
select * from `products` where `status` = 'active' order by `id` desc limit 8
select * from `categories` where `status` = 'active' and `is_parent` = 1 order by `title` asc
---
    public function index()
    {
        $featured = Product::whereStatus('active')->where('is_featured', 1)->orderBy('price',
            'DESC')->limit(2)->get();
        $posts = Post::whereStatus('active')->orderBy('id', 'DESC')->limit(3)->get();
        $banners = Banner::whereStatus('active')->limit(3)->orderBy('id', 'DESC')->get();
        // return $banner;
        $product_lists = Product::whereStatus('active')->orderBy('id', 'DESC')->limit(8)->get();
        $category_lists = Category::whereStatus('active')->where('is_parent', 1)->orderBy('title', 'ASC')->get();

select * from `products` where `status` = 'active' order by `id` desc limit 3
---
    public function productGrids()
    {
        $products = Product::query();

        if (!empty($_GET['category'])) {
            $slug = explode(',', $_GET['category']);
            $cat_ids = Category::select('id')->whereIn('slug', $slug)->pluck('id')->toArray();
            $products->whereIn('cat_id', $cat_ids);
        }
        if (!empty($_GET['brand'])) {
            $slugs = explode(',', $_GET['brand']);
            $brand_ids = Brand::select('id')->whereIn('slug', $slugs)->pluck('id')->toArray();
            return $brand_ids;
        }
        if (!empty($_GET['sortBy'])) {
            if ($_GET['sortBy'] == 'title') {
                $products = $products->where('status', 'active')->orderBy('title', 'ASC');
            }
            if ($_GET['sortBy'] == 'price') {
                $products = $products->orderBy('price', 'ASC');
            }
        }

        if (!empty($_GET['price'])) {
            $price = explode('-', $_GET['price']);
            $products->whereBetween('price', $price);
        }

        $recent_products = Product::where('status', 'active')->orderBy('id', 'DESC')->limit(3)->get();

select * from `products` where `status` = 'active' order by `id` desc limit 3
---
            $products->whereBetween('price', $price);
        }

        $recent_products = Product::where('status', 'active')->orderBy('id', 'DESC')->limit(3)->get();

select * from `posts` where `status` = 'active' order by `id` desc limit 9 offset 0
select count(*) as aggregate from `posts` where `status` = 'active'
select * from `posts` where `status` = 'active' order by `id` desc limit 3
---
    public function blog()
    {
        $post = Post::query();

        if (!empty($_GET['category'])) {
            $slug = explode(',', $_GET['category']);
            // dd($slug);
            return PostCategory::select('id')->whereIn('slug', $slug)->pluck('id')->toArray();
        }
        if (!empty($_GET['tag'])) {
            $slug = explode(',', $_GET['tag']);
            // dd($slug);
            $tag_ids = PostTag::select('id')->whereIn('slug', $slug)->pluck('id')->toArray();
            // return $tag_ids;
            $post->where('post_tag_id', $tag_ids);
            // return $post;
        }

        if (!empty($_GET['show'])) {
            $post = $post->where('status', 'active')->orderBy('id', 'DESC')->paginate($_GET['show']);
        } else {
            $post = $post->where('status', 'active')->orderBy('id', 'DESC')->paginate(9);
        }
        // $post=Post::where('status','active')->paginate(8);
        $rcnt_post = Post::where('status', 'active')->orderBy('id', 'DESC')->limit(3)->get();

select * from `posts` where `status` = 'active' order by `id` desc limit 3
---
    public function blogDetail($slug)
    {
        $post = Post::getPostBySlug($slug);
        $rcnt_post = Post::where('status', 'active')->orderBy('id', 'DESC')->limit(3)->get();