app/Http/Controllers/PostCommentController.php

insert into `post_comments` (`comment`, `post_id`, `parent_id`, `user_id`, `status`, `updated_at`, `created_at`) values ('test', '6', '', 2, 'active', '2022-03-05 05:14:20', '2022-03-05 05:14:20')
select * from `users` where `role` = 'admin'
---
    public function store(Request $request): RedirectResponse
    {
        $post_info = Post::getPostBySlug($request->slug);
        $data = $request->all();
        $data['user_id'] = $request->user()->id;
        $data['status'] = 'active';
        $status = PostComment::create($data);
        $user = User::where('role', 'admin')->get();