app/Models/Post.php

        public static function getPostBySlug($slug)
        {
            return Post::with(['tag_info', 'author_info'])->where('slug', $slug)->where('status', 'active')->first();
---
select * from `posts` where `slug` = 'lorem-ipsum-is-simply' and `status` = 'active' limit 1

        public static function countActivePost(): int
        {
            $data = Post::where('status', 'active')->count();
---
select count(*) as aggregate from `posts` where `status` = 'active'