app/Models/Product.php

select count(*) as aggregate from `products` where `status` = 'active'
---
        public static function countActiveProduct(): int
        {
            $data = Product::where('status', 'active')->count();