app/Http/Controllers/Admin/AdminController.php

select COUNT(*) as count, DAYNAME(created_at) as day_name, DAY(created_at) as day from `users` where `created_at` > '2022-02-27 00:00:00' group by `day_name`, `day` order by `day` asc
---
    public function index()
    {
        $data = User::select(DB::raw("COUNT(*) as count"), DB::raw("DAYNAME(created_at) as day_name"),
            DB::raw("DAY(created_at) as day"))
            ->where('created_at', '>', Carbon::today()->subDay(6))
            ->groupBy('day_name', 'day')
            ->orderBy('day')
            ->get();

select * from `settings` limit 1
---
    public function settings()
    {
        $data = Settings::first();