app/Http/Controllers/Admin/UsersController.php

        public function index(Request $request)
        {
            $users = User::orderBy('id', 'DESC')->paginate(5);
---
select * from `users` order by `id` desc limit 5 offset 0
select count(*) as aggregate from `users`